{
  "articles": [
    {
      "id": "1",
      "title": "Nelly Korda Wins 2024 LPGA Championship",
      "slug": "nelly-korda-wins-2024-lpga-championship",
      "excerpt": "Nelly Korda secured her second major championship victory with a stunning performance at the 2024 LPGA Championship, solidifying her position as one of the game's elite players.",
      "content": "Nelly Korda delivered a masterclass performance at the 2024 LPGA Championship, capturing her second major championship title with a four-stroke victory. The 25-year-old American showcased exceptional ball-striking and clutch putting throughout the tournament, finishing at 15-under par for the week.\n\nKorda's victory marks her 10th LPGA Tour win and further cements her status as one of the most dominant players in women's golf. Her consistent play under pressure and ability to rise to the occasion in major championships has made her a fan favorite and role model for aspiring young golfers.\n\nThe win also propels Korda to the top of the Rolex Rankings and strengthens her case for Player of the Year honors. Her performance included a course-record 63 in the second round and a crucial birdie on the 17th hole during the final round to seal the victory.",
      "date": "2024-04-20",
      "category": "LPGA Tour",
      "author": "Marie Hack"
    },
    {
      "id": "2",
      "title": "Rising Stars: The Future of Women's Golf",
      "slug": "rising-stars-future-womens-golf",
      "excerpt": "Meet the next generation of LPGA stars who are reshaping the landscape of women's professional golf with their innovative approaches and remarkable talent.",
      "content": "The landscape of women's professional golf is experiencing an exciting transformation as a new generation of talented players emerges on the LPGA Tour. These rising stars are not only bringing fresh energy to the sport but also innovative approaches to the game that are inspiring fans and fellow competitors alike.\n\nAmong the most promising newcomers is 22-year-old sensation Emma Rodriguez, whose aggressive playing style and social media presence have made her a fan favorite. Rodriguez's ability to connect with younger audiences while maintaining elite performance on the course represents the future of golf marketing and player engagement.\n\nAnother standout is 24-year-old Korean-American player Sarah Kim, whose precision iron play and mental toughness have drawn comparisons to LPGA legend Inbee Park. Kim's rise through the ranks has been marked by consistent improvement and a mature approach to tournament preparation.",
      "date": "2024-04-14",
      "category": "Features",
      "author": "Marie Hack"
    },
    {
      "id": "3",
      "title": "LPGA Announces Expanded Tournament Schedule for 2025",
      "slug": "lpga-expanded-tournament-schedule-2025",
      "excerpt": "The LPGA Tour has announced an ambitious expansion of its tournament schedule for 2025, including new events in emerging markets and increased prize money across the board.",
      "content": "The LPGA Tour has unveiled an ambitious expansion of its tournament schedule for the 2025 season, marking one of the most significant developments in women's professional golf in recent years. The announcement includes three new tournaments, increased prize money across existing events, and a renewed focus on global expansion.\n\nThe expanded schedule will feature 35 official events, up from 32 in 2024, with total prize money exceeding $100 million for the first time in LPGA history. New tournaments include the Dubai Ladies Classic, the Singapore Open, and the inaugural Women's World Championship in Australia.\n\nLPGA Commissioner Mollie Marcoux Samaan emphasized the tour's commitment to providing more opportunities for players while growing the global footprint of women's golf. 'This expansion represents our continued investment in the future of women's golf and our commitment to showcasing the world's best players on the biggest stages,' Marcoux Samaan stated.",
      "date": "2024-04-09",
      "category": "LPGA Tour",
      "author": "Marie Hack"
    }
  ]
}
